const timetableData = [
  {
    "クラス": "1年1組",
    "曜日": "月",
    "時限": 1,
    "科目": "歴史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "月",
    "時限": 2,
    "科目": "生基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "月",
    "時限": 3,
    "科目": "家",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "月",
    "時限": 4,
    "科目": "数Ａ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "月",
    "時限": 5,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "火",
    "時限": 1,
    "科目": "地理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "火",
    "時限": 2,
    "科目": "調査",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "火",
    "時限": 3,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "水",
    "時限": 1,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "水",
    "時限": 2,
    "科目": "数Ａ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "水",
    "時限": 3,
    "科目": "体育",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "木",
    "時限": 1,
    "科目": "保健",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "木",
    "時限": 2,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "木",
    "時限": 3,
    "科目": "体育",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "木",
    "時限": 4,
    "科目": "情報",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "木",
    "時限": 5,
    "科目": "物基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "金",
    "時限": 1,
    "科目": "情報",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "金",
    "時限": 2,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "金",
    "時限": 3,
    "科目": "現国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "金",
    "時限": 4,
    "科目": "生基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年1組",
    "曜日": "金",
    "時限": 5,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "月",
    "時限": 1,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "月",
    "時限": 2,
    "科目": "歴史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "月",
    "時限": 3,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "月",
    "時限": 4,
    "科目": "情報",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "月",
    "時限": 5,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "火",
    "時限": 1,
    "科目": "数Ａ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "火",
    "時限": 2,
    "科目": "調査",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "火",
    "時限": 3,
    "科目": "化基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "水",
    "時限": 1,
    "科目": "生基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "水",
    "時限": 2,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "水",
    "時限": 3,
    "科目": "体育",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "木",
    "時限": 1,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "木",
    "時限": 2,
    "科目": "地理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "木",
    "時限": 3,
    "科目": "体育",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "木",
    "時限": 4,
    "科目": "化基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "木",
    "時限": 5,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "金",
    "時限": 1,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "金",
    "時限": 2,
    "科目": "保健",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "金",
    "時限": 3,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "金",
    "時限": 4,
    "科目": "現国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年2組",
    "曜日": "金",
    "時限": 5,
    "科目": "物基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "月",
    "時限": 1,
    "科目": "数Ａ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "月",
    "時限": 2,
    "科目": "化基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "月",
    "時限": 3,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "月",
    "時限": 4,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "月",
    "時限": 5,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "火",
    "時限": 1,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "火",
    "時限": 2,
    "科目": "調査",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "火",
    "時限": 3,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "水",
    "時限": 1,
    "科目": "化基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "水",
    "時限": 2,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "水",
    "時限": 3,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "木",
    "時限": 1,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "木",
    "時限": 2,
    "科目": "現国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "木",
    "時限": 3,
    "科目": "家庭",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "木",
    "時限": 4,
    "科目": "物基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "木",
    "時限": 5,
    "科目": "歴史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "金",
    "時限": 1,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "金",
    "時限": 2,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "金",
    "時限": 3,
    "科目": "化基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "金",
    "時限": 4,
    "科目": "地理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年3組",
    "曜日": "金",
    "時限": 5,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "月",
    "時限": 1,
    "科目": "地理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "月",
    "時限": 2,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "月",
    "時限": 3,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "月",
    "時限": 4,
    "科目": "物基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "月",
    "時限": 5,
    "科目": "生基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "火",
    "時限": 1,
    "科目": "化基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "火",
    "時限": 2,
    "科目": "調査",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "火",
    "時限": 3,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "水",
    "時限": 1,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "水",
    "時限": 2,
    "科目": "現国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "水",
    "時限": 3,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "木",
    "時限": 1,
    "科目": "家庭",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "木",
    "時限": 2,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "木",
    "時限": 3,
    "科目": "数Ａ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "木",
    "時限": 4,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "木",
    "時限": 5,
    "科目": "情報",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "金",
    "時限": 1,
    "科目": "数Ⅰ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "金",
    "時限": 2,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "金",
    "時限": 3,
    "科目": "歴史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "金",
    "時限": 4,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年4組",
    "曜日": "金",
    "時限": 5,
    "科目": "生基",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "月",
    "時限": 1,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "月",
    "時限": 2,
    "科目": "情報",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "月",
    "時限": 3,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "月",
    "時限": 4,
    "科目": "歴史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "月",
    "時限": 5,
    "科目": "数α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "火",
    "時限": 1,
    "科目": "地理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "火",
    "時限": 2,
    "科目": "調査",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "火",
    "時限": 3,
    "科目": "数α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "水",
    "時限": 1,
    "科目": "物理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "水",
    "時限": 2,
    "科目": "地理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "水",
    "時限": 3,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "木",
    "時限": 1,
    "科目": "歴史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "木",
    "時限": 2,
    "科目": "情報",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "木",
    "時限": 3,
    "科目": "生物",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "木",
    "時限": 4,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "木",
    "時限": 5,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "金",
    "時限": 1,
    "科目": "物理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "金",
    "時限": 2,
    "科目": "数α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "金",
    "時限": 3,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "金",
    "時限": 4,
    "科目": "情報",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年5組",
    "曜日": "金",
    "時限": 5,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "月",
    "時限": 1,
    "科目": "現国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "月",
    "時限": 2,
    "科目": "物理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "月",
    "時限": 3,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "月",
    "時限": 4,
    "科目": "地理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "月",
    "時限": 5,
    "科目": "数β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "火",
    "時限": 1,
    "科目": "保",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "火",
    "時限": 2,
    "科目": "調査",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "火",
    "時限": 3,
    "科目": "EW",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "水",
    "時限": 1,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "水",
    "時限": 2,
    "科目": "数β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "水",
    "時限": 3,
    "科目": "現国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "木",
    "時限": 1,
    "科目": "数β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "木",
    "時限": 2,
    "科目": "歴史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "木",
    "時限": 3,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "木",
    "時限": 4,
    "科目": "生物",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "木",
    "時限": 5,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "金",
    "時限": 1,
    "科目": "言文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "金",
    "時限": 2,
    "科目": "情報",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "金",
    "時限": 3,
    "科目": "家",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "金",
    "時限": 4,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "1年6組",
    "曜日": "金",
    "時限": 5,
    "科目": "数α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "月",
    "時限": 1,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "月",
    "時限": 2,
    "科目": "芸2",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "月",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "月",
    "時限": 4,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "月",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "月",
    "時限": 6,
    "科目": "国探",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "火",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "火",
    "時限": 2,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "火",
    "時限": 3,
    "科目": "EW",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "水",
    "時限": 1,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "水",
    "時限": 2,
    "科目": "公共",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "水",
    "時限": 3,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "木",
    "時限": 1,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "木",
    "時限": 2,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "木",
    "時限": 3,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "木",
    "時限": 4,
    "科目": "公共",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "木",
    "時限": 5,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "金",
    "時限": 1,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "金",
    "時限": 2,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "金",
    "時限": 3,
    "科目": "英試",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "金",
    "時限": 4,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2国探",
    "曜日": "金",
    "時限": 5,
    "科目": "自α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "月",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "月",
    "時限": 2,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "月",
    "時限": 3,
    "科目": "芸",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "月",
    "時限": 4,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "月",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "火",
    "時限": 1,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "火",
    "時限": 2,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "火",
    "時限": 3,
    "科目": "漢文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "水",
    "時限": 1,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "水",
    "時限": 2,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "水",
    "時限": 3,
    "科目": "芸",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "木",
    "時限": 1,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "木",
    "時限": 2,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "木",
    "時限": 3,
    "科目": "世史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "木",
    "時限": 4,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "木",
    "時限": 5,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "金",
    "時限": 1,
    "科目": "公共",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "金",
    "時限": 2,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "金",
    "時限": 3,
    "科目": "英試",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "金",
    "時限": 4,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年1組",
    "曜日": "金",
    "時限": 5,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "月",
    "時限": 1,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "月",
    "時限": 2,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "月",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "月",
    "時限": 4,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "月",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "火",
    "時限": 1,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "火",
    "時限": 2,
    "科目": "漢文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "火",
    "時限": 3,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "水",
    "時限": 1,
    "科目": "公共",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "水",
    "時限": 2,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "水",
    "時限": 3,
    "科目": "自α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "木",
    "時限": 1,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "木",
    "時限": 2,
    "科目": "世史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "木",
    "時限": 3,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "木",
    "時限": 4,
    "科目": "公共",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "木",
    "時限": 5,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "金",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "金",
    "時限": 2,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "金",
    "時限": 3,
    "科目": "英試",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "金",
    "時限": 4,
    "科目": "芸",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年2組",
    "曜日": "金",
    "時限": 5,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "月",
    "時限": 1,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "月",
    "時限": 2,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "月",
    "時限": 3,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "月",
    "時限": 4,
    "科目": "公共",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "月",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "火",
    "時限": 1,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "火",
    "時限": 2,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "火",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "水",
    "時限": 1,
    "科目": "古典",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "水",
    "時限": 2,
    "科目": "芸",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "水",
    "時限": 3,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "木",
    "時限": 1,
    "科目": "公共",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "木",
    "時限": 2,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "木",
    "時限": 3,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "木",
    "時限": 4,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "木",
    "時限": 5,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "金",
    "時限": 1,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "金",
    "時限": 2,
    "科目": "物生",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "金",
    "時限": 3,
    "科目": "英試",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "金",
    "時限": 4,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年3組",
    "曜日": "金",
    "時限": 5,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "月",
    "時限": 1,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "月",
    "時限": 2,
    "科目": "物理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "月",
    "時限": 3,
    "科目": "地理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "月",
    "時限": 4,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "月",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "火",
    "時限": 1,
    "科目": "公共",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "火",
    "時限": 2,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "火",
    "時限": 3,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "水",
    "時限": 1,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "水",
    "時限": 2,
    "科目": "古典",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "水",
    "時限": 3,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "木",
    "時限": 1,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "木",
    "時限": 2,
    "科目": "地理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "木",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "木",
    "時限": 4,
    "科目": "芸",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "木",
    "時限": 5,
    "科目": "数Ｂ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "金",
    "時限": 1,
    "科目": "保",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "金",
    "時限": 2,
    "科目": "古典",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "金",
    "時限": 3,
    "科目": "英試",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "金",
    "時限": 4,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2年4組",
    "曜日": "金",
    "時限": 5,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "月",
    "時限": 1,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "月",
    "時限": 2,
    "科目": "芸2",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "月",
    "時限": 3,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "月",
    "時限": 4,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "月",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "月",
    "時限": 6,
    "科目": "理探",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "火",
    "時限": 1,
    "科目": "EW",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "火",
    "時限": 2,
    "科目": "数β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "火",
    "時限": 3,
    "科目": "物生",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "水",
    "時限": 1,
    "科目": "物生",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "水",
    "時限": 2,
    "科目": "数β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "水",
    "時限": 3,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "木",
    "時限": 1,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "木",
    "時限": 2,
    "科目": "数β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "木",
    "時限": 3,
    "科目": "古漢",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "木",
    "時限": 4,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "木",
    "時限": 5,
    "科目": "公共",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "金",
    "時限": 1,
    "科目": "物生",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "金",
    "時限": 2,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "金",
    "時限": 3,
    "科目": "英試",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "金",
    "時限": 4,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "2理探",
    "曜日": "金",
    "時限": 5,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "月",
    "時限": 1,
    "科目": "数A",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "月",
    "時限": 2,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "月",
    "時限": 3,
    "科目": "古典",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "月",
    "時限": 4,
    "科目": "自α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "月",
    "時限": 5,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "火",
    "時限": 1,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "火",
    "時限": 2,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "火",
    "時限": 3,
    "科目": "自α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "水",
    "時限": 1,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "水",
    "時限": 2,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "水",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "木",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "木",
    "時限": 2,
    "科目": "世史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "木",
    "時限": 3,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "木",
    "時限": 4,
    "科目": "数B",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "木",
    "時限": 5,
    "科目": "EW",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "金",
    "時限": 1,
    "科目": "漢文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "金",
    "時限": 2,
    "科目": "世史",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "金",
    "時限": 3,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "金",
    "時限": 4,
    "科目": "数B",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3国探",
    "曜日": "金",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "月",
    "時限": 1,
    "科目": "自α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "月",
    "時限": 2,
    "科目": "社β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "月",
    "時限": 3,
    "科目": "社α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "月",
    "時限": 4,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "月",
    "時限": 5,
    "科目": "数B",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "火",
    "時限": 1,
    "科目": "Ca",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "火",
    "時限": 2,
    "科目": "古典",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "火",
    "時限": 3,
    "科目": "数B",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "水",
    "時限": 1,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "水",
    "時限": 2,
    "科目": "数B",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "水",
    "時限": 3,
    "科目": "社α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "木",
    "時限": 1,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "木",
    "時限": 2,
    "科目": "漢文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "木",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "木",
    "時限": 4,
    "科目": "自α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "木",
    "時限": 5,
    "科目": "数A",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "金",
    "時限": 1,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "金",
    "時限": 2,
    "科目": "Ca",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "金",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "金",
    "時限": 4,
    "科目": "社β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年1組",
    "曜日": "金",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "月",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "月",
    "時限": 2,
    "科目": "社β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "月",
    "時限": 3,
    "科目": "社α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "月",
    "時限": 4,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "月",
    "時限": 5,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "火",
    "時限": 1,
    "科目": "数A",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "火",
    "時限": 2,
    "科目": "Ca",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "火",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "水",
    "時限": 1,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "水",
    "時限": 2,
    "科目": "Ca",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "水",
    "時限": 3,
    "科目": "社α",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "木",
    "時限": 1,
    "科目": "英b",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "木",
    "時限": 2,
    "科目": "数B",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "木",
    "時限": 3,
    "科目": "漢文",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "木",
    "時限": 4,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "木",
    "時限": 5,
    "科目": "自β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "金",
    "時限": 1,
    "科目": "Ca",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "金",
    "時限": 2,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "金",
    "時限": 3,
    "科目": "数B",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "金",
    "時限": 4,
    "科目": "社β",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年2組",
    "曜日": "金",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "月",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "月",
    "時限": 2,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "月",
    "時限": 3,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "月",
    "時限": 4,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "月",
    "時限": 5,
    "科目": "物理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "火",
    "時限": 1,
    "科目": "物理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "火",
    "時限": 2,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "火",
    "時限": 3,
    "科目": "数Ⅲ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "水",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "水",
    "時限": 2,
    "科目": "数Ⅲ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "水",
    "時限": 3,
    "科目": "物理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "木",
    "時限": 1,
    "科目": "応数",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "木",
    "時限": 2,
    "科目": "物理",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "木",
    "時限": 3,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "木",
    "時限": 4,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "木",
    "時限": 5,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "金",
    "時限": 1,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "金",
    "時限": 2,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "金",
    "時限": 3,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "金",
    "時限": 4,
    "科目": "応数",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年3組",
    "曜日": "金",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "月",
    "時限": 1,
    "科目": "応数",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "月",
    "時限": 2,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "月",
    "時限": 3,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "月",
    "時限": 4,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "月",
    "時限": 5,
    "科目": "古典",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "火",
    "時限": 1,
    "科目": "数Ⅲ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "火",
    "時限": 2,
    "科目": "物生",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "火",
    "時限": 3,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "水",
    "時限": 1,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "水",
    "時限": 2,
    "科目": "数Ⅲ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "水",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "木",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "木",
    "時限": 2,
    "科目": "応数",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "木",
    "時限": 3,
    "科目": "物生",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "木",
    "時限": 4,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "木",
    "時限": 5,
    "科目": "英C",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "金",
    "時限": 1,
    "科目": "応数",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "金",
    "時限": 2,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "金",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "金",
    "時限": 4,
    "科目": "論表",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3年4組",
    "曜日": "金",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "月",
    "時限": 1,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "月",
    "時限": 2,
    "科目": "体",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "月",
    "時限": 3,
    "科目": "物生",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "月",
    "時限": 4,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "月",
    "時限": 5,
    "科目": "数E",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "火",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "火",
    "時限": 2,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "火",
    "時限": 3,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "火",
    "時限": 4,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "火",
    "時限": 5,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "火",
    "時限": 6,
    "科目": "鑑賞",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "水",
    "時限": 1,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "水",
    "時限": 2,
    "科目": "総英",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "水",
    "時限": 3,
    "科目": "数E",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "木",
    "時限": 1,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "木",
    "時限": 2,
    "科目": "EW",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "木",
    "時限": 3,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "木",
    "時限": 4,
    "科目": "数Ⅱ",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "木",
    "時限": 5,
    "科目": "日地",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "木",
    "時限": 6,
    "科目": "LHR",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "金",
    "時限": 1,
    "科目": "論国",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "金",
    "時限": 2,
    "科目": "数E",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "金",
    "時限": 3,
    "科目": "化学",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "金",
    "時限": 4,
    "科目": "物生",
    "担当教師": "",
    "教室": ""
  },
  {
    "クラス": "3理探",
    "曜日": "金",
    "時限": 5,
    "科目": "総合",
    "担当教師": "",
    "教室": ""
  }
];